Tekla Open API Reference for Tekla Structures 2025
SpiralBeam.RotationAxisDirection Property
 Gets the direction of the spiral beam rotation axis.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector RotationAxisDirection { get; }
Public ReadOnly Property RotationAxisDirection As Vector
	Get
Property Value
Type: Vector
See Also
Reference
SpiralBeam Class
Tekla.Structures.Model Namespace